import { defineStore } from "pinia";
import { reactive,watch } from 'vue'

export const useSongListStore = defineStore('songlist',() => {
    //定义歌曲类型
    interface song {
        id: number
        name: string
        singers: string
        img: string
        src: string
        videoSrc:string
        time: string
        like: boolean
        isplay: boolean,
        lyric: string,
    }
    //定义歌单类型
    interface typeOne {
        id:number,
        songListImg:string,
        pageview?:number,
        title:string,
        content?:string,
        song:song[],
        isDelete?:boolean
    }
    //声明歌单列表
    let songLists = reactive<typeOne[]>([
        {
            id:1,
            songListImg: '/images/hotmusic.png',
            pageview: 500,
            title: '一拍俩散',
            content: '一拍俩散|验过伤可否惹你内疚',
            song:[
                {
                    id: 8,
                    name: '离开我的依赖',
                    singers: '王艳薇',
                    img: '/images/ninemusic.webp',
                    src: '/audio/离开我的依赖.mp3',
                    videoSrc: '//player.bilibili.com/player.html?isOutside=true&aid=882617326&bvid=BV1ZK4y1C7SB&cid=173117504&p=1',
                    time: '03:53',
                    like: false,
                    isplay: false,
                    lyric: `
                    [00:00.00]离开我的依赖 (Leaving) - 王艳薇
                    [00:02.00]词：王艳薇
                    [00:03.00]曲：王艳薇
                    [00:10.00]说不出你的轮廓
                    [00:17.00]看着你的模样
                    [00:25.00]眼前的美风雨冲淡了它
                    [00:32.00]看天色渐暗了
                    [00:40.00]好陌生的一句话
                    [00:47.00]你看着我说话
                    [00:55.00]我蒙上了眼
                    [00:59.00]仿佛你在身旁
                    [01:02.00]当你不再应答
                    [01:09.00]我来不及道声不安
                    [01:12.00]有点混乱有点缓慢
                    [01:16.00]才发现承诺是谎话
                    [01:20.00]你倒下了我只能旁观
                    [01:24.00]我越来越爱
                    [01:26.00]爱不爱
                    [01:28.00]都成为我们的负担
                    [01:32.00]我想要痛快的离开我的依赖
                    [01:49.00]一句句你的责骂
                    [01:55.00]是存在的代价
                    [02:03.00]不想让我慌乱认痛责备的话
                    [02:11.00]看天再一次暗了
                    [02:18.00]我来不及道声不安
                    [02:21.00]有点混乱有点缓慢
                    [02:25.00]才发现承诺是谎话
                    [02:29.00]你倒下了我只能旁观
                    [02:33.00]我越来越爱
                    [02:35.00]爱不爱
                    [02:37.00]都成为我们的负担
                    [02:40.00]我想要痛快的离开我的依赖
                    [02:48.00]多少个忍受痛的夜晚你叫我别回来
                    [02:56.00]我挣扎看你的脸憔悴的心怎放得开
                    [03:07.00]我来不及道声不安
                    [03:10.00]有点混乱有点缓慢
                    [03:14.00]才发现承诺是谎话
                    [03:18.00]你倒下了我只能旁观
                    [03:22.00]我越来越爱
                    [03:24.00]爱不爱
                    [03:26.00]都成为我们的负担
                    [03:30.00]我想要痛快的离开我的依赖
                    [03:37.00]我想要痛快的离开我的依赖
                    `,
                },
            ]
        },
        {
            id: 2,
            songListImg: '/images/hotmusic1.jpg',
            pageview: 1000,
            title: '你还在吗',
            content: '看清你的时候 我的眼泪也在流泪',
            song: [
                {
                    id: 6,
                    name: '我看过',
                    singers: '小野来了',
                    img: '/images/sevenmusic.webp',
                    src: '/audio/我看过.mp3',
                    videoSrc: '//player.bilibili.com/player.html?isOutside=true&aid=115497223915940&bvid=BV1Jf14BoE6H&cid=33728038115&p=1',
                    time: '02:34',
                    like: false,
                    isplay: false,
                    lyric: `
                    [00:00.00]小野来了-我看过（亲爱的不要再说你还爱我）
                    [00:00.00]作词: 曾歆沂/黄政彬/周星星
                    [00:00.00]作曲: 吴周烁/佳旺/周星星
                    [00:00.00]亲爱的不要再说你还爱我
                    [00:03.00]因为看过你爱我的样子
                    [00:16.00]你的回答都犹豫了一下
                    [00:24.00]在我面前怎么开始害怕说错话
                    [00:31.00]你在眺望窗外无关的景象
                    [00:36.00]保持沉默和你的优雅
                    [00:46.00]想陪你假装没事
                    [00:50.00]天真把分开延迟
                    [00:54.00]现实却比我们诚实
                    [01:01.00]我看过你说好一辈子
                    [01:05.00]我看过你的无微不至
                    [01:09.00]我看过你说想要时间停止
                    [01:13.00]拉着我的手喊我名字
                    [01:16.00]我看过你说谎的方式
                    [01:20.00]我看过爱情自然变质
                    [01:24.00]就算错过这样到此为止
                    [01:32.00]至少我看过你爱我的样子
                    [01:37.00]沉默空气戳破你的心事
                    [01:41.00]你难过伤心又有几次
                    [01:45.00]你脸上的陌生表情
                    [01:47.00]是你给的诠释
                    [01:51.00]我看着你飘忽的心思
                    [01:54.00]也看见我无谓的坚持
                    [01:58.00]亲爱的不要再说你还爱我
                    [02:02.00]因为看过你爱我的样子
                    [02:06.00]我看过的最美的落日
                    [02:10.00]是你陪我看海的样子
                    [02:14.00]就算错过这样到此为止
                    [02:21.00]至少我看过你爱我的样子
                    `,
                },
            ]
        },
        {
            id:3,
            songListImg: '/images/hotmusic2.jpg',
            pageview: 5000,
            title: '我想你了',
            content: '你那么好 答应我别总为别人哭好吗',
            song:[
                {
                    id: 7,
                    name: '孤独患者',
                    singers: '陈奕迅',
                    img: '/images/eightmusic.webp',
                    src: '/audio/孤独患者.mp3',
                    videoSrc: '//player.bilibili.com/player.html?isOutside=true&aid=316097404&bvid=BV1PP411C75t&cid=1198991947&p=1',
                    time: '04:33',
                    like: false,
                    isplay: false,
                    lyric: `
                    [00:00.00]孤独患者 (国) - 陈奕迅
                    [00:05.00]词：小寒
                    [00:08.00]曲：方大同
                    [00:11.00]编曲：方大同/陈浩然
                    [00:17.00]欢笑声欢呼声
                    [00:20.00]吵热气氛心却很冷
                    [00:24.00]聚光灯是种蒙恩
                    [00:27.00]我却不能喊等一等
                    [00:31.00]我真佩服我还能幽默
                    [00:35.00]掉眼泪时用笑掩过
                    [00:38.00]怕人看破顾虑好多
                    [00:42.00]不谈寂寞我们就都快活
                    [00:48.00]我不唱声嘶力竭的情歌
                    [00:55.00]不表示没有心碎的时刻
                    [01:02.00]我不曾摊开伤口任宰割
                    [01:08.00]愈合就无人晓得
                    [01:13.00]我内心挫折
                    [01:16.00]活像个孤独患者自我拉扯
                    [01:24.00]外向的孤独患者有何不可
                    [01:39.00]笑越大声越是残忍
                    [01:43.00]挤满体温室温更冷
                    [01:47.00]万一关灯空虚扰人
                    [01:50.00]我却不能喊等一等
                    [01:54.00]你说你爱我却一直说
                    [01:57.00]说我不该窝在角落
                    [02:01.00]策划逃脱这也有错
                    [02:04.00]连我脆弱的权利都掠夺
                    [02:10.00]我不唱声嘶力竭的情歌
                    [02:17.00]不表示没有心碎的时刻
                    [02:24.00]我不曾摊开伤口任宰割
                    [02:30.00]愈合就无人晓得
                    [02:35.00]我内心挫折
                    [02:39.00]活像个孤独患者自我拉扯
                    [02:46.00]外向的孤独患者有何不可
                    [03:21.00]我不要声嘶力竭的情歌
                    [03:28.00]来提示我需要你的时刻
                    [03:35.00]表面镇定并不是保护色
                    [03:41.00]反而是要你懂得
                    [03:46.00]我不知为何
                    [03:50.00]活像个孤独患者自我拉扯
                    [03:56.00]外向的孤独患者需要认可
                    `,
                }
            ]
        },
        {
            id:4,
            songListImg: '/images/hotmusic3.png',
            pageview: 2500,
            title: '万圣节专属',
            content: '欧美暗黑怪诞风 开启限定狂欢',
            song:[
                {
                    id: 1,
                    name: '爱错',
                    singers: '王力宏',
                    img: '/images/twomusic.webp',
                    src: '/audio/爱错.mp3',
                    videoSrc: '//player.bilibili.com/player.html?isOutside=true&aid=971589390&bvid=BV1Lp4y1p7nc&cid=292274462&p=1',
                    time: '03:58',
                    like: false,
                    isplay: false,
                    lyric: `
                    [00:00.00]爱错 - 王力宏 (Leehom Wang)
                    [00:04.00]词：王力宏/崔惟楷
                    [00:09.00]曲：王力宏
                    [00:14.00]北风毫不留情
                    [00:18.00]把叶子吹落
                    [00:21.00]脆弱的她选择了逃脱
                    [00:27.00]叶子失去消息
                    [00:30.00]风才感觉寂寞
                    [00:36.00]整个冬天 北风的痛没人能说
                    [00:46.00]我从来没想过我会这样做
                    [00:52.00]从来没爱过所以爱错
                    [00:59.00]我从哪里起飞
                    [01:02.00]从哪里降落
                    [01:06.00]多少不能原谅的错
                    [01:09.00]却不能重来过
                    [01:20.00]翻开回忆角落完美的生活
                    [01:26.00]以为幸福都可以掌握
                    [01:33.00]仔细回味当初那个故事背后
                    [01:42.00]Oh 原来是我 原来是我
                    [01:45.00]犯下从没承认的错
                    [01:51.00]我从来没想过我会这样做
                    [01:58.00]从来没爱过所以爱错
                    [02:04.00]我从哪里起飞从哪里降落
                    [02:11.00]多少不能原谅的错
                    [02:15.00]却不能重来过
                    [02:23.00]在这少了你的世界 Oh
                    [02:29.00]找不回那些感觉
                    [02:34.00]其实我不想道别那些过去
                    [02:44.00]我从来没想过我会这样做
                    [02:51.00]从来没爱过所以爱错
                    [02:55.00]从来没有爱过那么认真
                    [02:58.00]我从哪里起飞
                    [03:00.00]从哪里降落
                    [03:04.00]多少不能原谅的错
                    [03:07.00]却不能重
                    [03:10.00]我从来没想过我会这样做
                    [03:17.00]从来没爱过所以爱错
                    [03:24.00]我从哪里起飞
                    [03:27.00]从哪里降落
                    [03:30.00]多少不能原谅的错
                    [03:34.00]请你原谅我的爱错
                    `,
                }
            ]
        },
    ])
    const createSongListOne = localStorage.getItem('MySongList')
    const createSongListTwo = createSongListOne ? JSON.parse(createSongListOne) : []
    const createSongList = reactive<typeOne[]>(createSongListTwo)
    //先从localStorage读取存储的歌单数据
    const storeSongLists = localStorage.getItem('songListOne')
    //解析数据
    const initialSongLists = storeSongLists ? JSON.parse(storeSongLists) : songLists
    //再将songLists重新初始化
    songLists = reactive<typeOne[]>(initialSongLists)
    return { songLists,createSongList }
})